import type { IntroducePayload } from "@/components/introduce/Introduce";

const payload: IntroducePayload[] = [
  "문제 해결과 사용자 경험을 최적화하는 데 집중하고, 단순한 구현을 넘어 구조까지 설계하는 프론트엔드 엔지니어입니다.",
  "항상 문제를 해결을 위해 ”어떤 문제인지, 왜 이 구조와 기능이 필요했으며, 어떤 흐름으로 이어져야 하는가?”에 집중합니다. 특히 중요도와 우선순위를 단계별로 나누어 방향성을 잡는 것이 중요하다고 생각합니다. 여러 직군과 함께 일할 수 있도록 기준과 언어를 정리하며, 다양한 제약 속에서도 현실적인 구현 경로를 찾는 과정을 구상합니다. 업무의 경계를 넘나들며 생산성을 위한 번역 시스템 자동화, 디자인 시스템 구축 등 조직에 필요한 기술 기반을 먼저 제시하고, 개선 사항은 문서화하고 자동화해 팀 내외에 공유해 왔습니다.",
  "또한 평소 AI 에이전트를 적극적으로 활용하여, 빠른 프로토타입과 PoC를 제공해 기획 및 제품의 방향성을 먼저 제시하며 제품 퀄리티와 속도를 함께 이어가도록 하고 있습니다. 이론 지식과 신기술 적용을 현업에 더욱 적극적으로 적용하게 되었고, 성능 개선은 물론 비즈니스 임팩트를 함께 가져올 수 있는 경험을 쌓고 있습니다.",
  "프론트엔드 개발이란 비즈니스와 개발의 소통이 가장 중요하다고 생각합니다. 능동적이고 적극적인 행동으로 문제 해결과 비즈니스 임팩트를 위해 도전하고 있습니다.  작은 설계 하나가 동료의 반복 작업을 줄이고, 사용자 경험을 바꾸는 순간들을 소중히 여기며, 그런 흐름을 함께 만들어가는 팀을 위해 꾸준한 학습, 경험, 노력을 하고 있습니다.",
];
//  문제 해결 인식에 집중한다 내용.
export default payload;
